print('''
 ________________________________________________________
| __   ..   __  |  `                 `   :  ;    ;  ;    |
| |_; .--. :  ' |   ````````.````````    )  ;    ;  ;   ;|
| |_; :__; :__, |    `  `  /_\  `  `    ;  ;    ;   ;   ;|
| ___ ___       |\   `    (':')    `   /  ;    ;   ;   ; |
| |_   |   |    | :.______;\-/:______.; ;     ;   ;    ; |
| |__  |   |__  |_ /`````(``v``)`````\,__   ;    ;    ;  |
|_______________| '------:``:``;------`  );     ;    ;   |
|___:    :     :   ,-.| _/:o``:\_ |,-.   ;     ;    ;    |
|:: ::    ":    `._`-':__(:+``:)__:`-'_.'    ;"    ;     |
|::  : :    ":_    "-,'__;;``o::__`.-"    _;"    ;__     |
|: : ;  ":     ":_   |___);``+:(___|   _;"     ;"   """--|
| ::: ___ ":_     "--;___;;c``::___:--"     _;"          |
|   :;_|_:   ":__   ,'___L-___-J___`.   __;"------------ |
|   ::_\_;       "--|_______________|--"__            /""|
|___:______,...---'';_______________:     """----...__|: |
|   ;   ((   `` .. ,'_____ (( ______`.    ..          |: |
|  ; __;==\ `      |___ __;==\ ______| .``  ``..  ``  |: |
|_;  `---' \__     ;____`---' \__ ___:          ``    |: |
| ~~~~   ),/ `""""----)_____),/ `""""----)           ,"""|
|        \/ ;  ____   \_____\/ ;  ____   \ ~~~~~~~ _|____|
|        ( ;"""   "\"\ \____(_ ;""___"\"\ \     ,\=|\ctr |
|\       `||     ,'_\\\ ;___//||______ \\\ ;    |: ||""""|
| \       ||'    |__||_\\__((_||_______|| \\____|:_|:''|||
|--\------||'--- ;_ || //__||_||____[_]|| //       |`".__|
|\\_\____""________""_""__""_""_ _____""_""________|+____|

''')
print("Selamat Datang di TEST Kepribadian.")
mulai = input("Apakah kalian mau memulainya? 'Y' atau 'T' ")

#Write your code below this line 👇

if mulai.lower() == 'y':
    print('''\n
                 ,.  _~-.,               .
           ~'`_ \/,_. \_
          / ,"_>@`,__`~.)             |           .
          | |  @@@@'  ",! .           .          '
          |/   ^^@     .!  \          |         /
          `' .^^^     ,'    '         |        .             .
           .^^^   .          \                /          .
          .^^^       '  .     \       |      /       . '
.,.,.     ^^^             ` .   .,+~'`^`'~+,.     , '
&&&&&&,  ,^^^^.  . ._ ..__ _  .'             '. '_ __ ____ __ _ .. .  .
%%%%%%%%%^^^^^^%%&&;_,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,
&&&&&%%%%%%%%%%%%%%%%%%&&;,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^`'~=
%%%%%&&&&&&&&&&&%%%%&&&_,.;^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,
%%%%%%%%%&&&&&&&&&-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,.-==--^'~=-.,__,.-=~'
##mjy#####*"'
_,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,.-=~'`^`'~=-.,__,.-=~'

~`'^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^`'~=-.,__,.-=~'`^
''')
    pantai = input(
        "\nBayangkan kamu berada di sebuah pantai.\nBerapa banyak jumlah orang yang ada di pantai tersebut?\nB = Banyak S = Sedikit? "
    )
    print("\n")
    if pantai.lower() == 'b':
        print(
            '"Rupanya kamu termasuk orang yang suka menjalin pertemanan dengan siapa saja." '
        )
    else:
        print(
            '"Rupanya kamu hanya suka menjalin pertemanan dengan beberapa orang saja." '
        )

print('''\n
                    


                  
                     %%%%
                    %%%%-(
                  _%%%%%_/                        \ ' /
                _%%%%%%%%                        - (_) -
              _%%%%%%%/ \%                        / , \
             %%%%%%%%%\\ \_  
               %%%%%%   \ \\
                   )    /\_/
                 /(___. \
                 '----' (
                /       )
    ---....____/        (_____ __ _ ___ ___ __ _ _ _____ _ _ ___
              /         )---...___ =-= = -_= -=_= _-=_-_ -=- =-_
            ,'          (         ```--.._= -_= -_= _-=- -_= _=-
         ,-'            )                 ``--._=-_ =-=_-= _-= _
         '-._    '-..___(                       ``-._=_-=_- =_-=
             ``---....__)                            `-._-=_-_=-
                   )|)|                                  `-._=-_
        krt       '-'-.\_                                    `-.



''')
orang = input(
    "\nSeberapa jauh jarak kamu dengan orang-orang yang ada di pantai itu?\nJ = Jauh D = Dekat ? "
)
if orang.lower() == 'j':
    print('\n"berarti kamu termasuk orang yang tertutup."')
elif orang.lower() == 'd':
    print(
        '\n"berarti kamu termasuk orang yang mudah terbuka, sekalipun dengan orang baru."'
    )

print('''\n
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠓⠒⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠀⠀⠀⠀⠀⢠⢤⣤⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠔⠒⠒⠲⠎⠀⠀⢹⡃⢀⣀⠀⠑⠃⠀⠈⢀⠔⠒⢢⠀⠀⠀⡖⠉⠉⠉⠒⢤⡀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠔⠚⠙⠒⠒⠒⠤⡎⠀⠀⠀⠀⢀⣠⣴⣦⠀⠈⠘⣦⠑⠢⡀⠀⢰⠁⠀⠀⠀⠑⠰⠋⠁⠀⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠁⠀⠀⠀⠀⠀⠀⢰⠃⠀⣀⣀⡠⣞⣉⡀⡜⡟⣷⢟⠟⡀⣀⡸⠀⡎⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⣻⠀⠀⠀⠀
⢰⠂⠀⠀⠀⠀⠀⠀⠀⣗⠀⠀⢀⣀⣀⣀⣀⣀⣓⡞⢽⡚⣑⣛⡇⢸⣷⠓⢻⣟⡿⠻⣝⢢⠀⢇⣀⡀⠀⠀⠀⢈⠗⠒⢶⣶⣶⡾⠋⠉⠀⠀⠀⠀⠀
⠈⠉⠀⠀⠀⠀⠀⢀⠀⠈⠒⠊⠻⣷⣿⣚⡽⠃⠉⠀⠀⠙⠿⣌⠳⣼⡇⠀⣸⣟⡑⢄⠘⢸⢀⣾⠾⠥⣀⠤⠖⠁⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⢀⠀⠀
⠀⠀⠀⢰⢆⠀⢀⠏⡇⠀⡀⠀⠀⠀⣿⠉⠀⠀⠀⠀⠀⠀⠀⠈⢧⣸⡇⢐⡟⠀⠙⢎⢣⣿⣾⡷⠊⠉⠙⠢⠀⠀⠀⠀⠀⢸⡇⢀⠀⠀⠀⠀⠈⠣⡀
⠀⠀⠀⠘⡌⢣⣸⠀⣧⢺⢃⡤⢶⠆⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣟⠋⢀⠔⣒⣚⡋⠉⣡⠔⠋⠉⢰⡤⣇⠀⠀⠀⠀⢸⡇⡇⠀⠀⠀⠀⠀⠀⠸
⠀⠀⠀⠀⠑⢄⢹⡆⠁⠛⣁⠔⠁⠀⣿⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⣿⢠⡷⠋⠁⠀⠈⣿⡇⠀⠀⠀⠈⡇⠉⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠑⣦⡔⠋⠁⠀⠀⠀⣿⠀⠀⢠⡀⢰⣼⡇⠀⡀⠀⠀⣿⠀⠁⠀⠀⠀⠀⣿⣷⠀⠀⠀⠀⡇⠀⠀⢴⣤⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⡇⠀⠀⠀⠀⠀⣿⡀⠀⢨⣧⡿⠋⠀⠘⠛⠀⠀⣿⠀⠀⢀⠀⠀⠀⣿⣿⠀⠀⠀⠀⢲⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⠀⠀⠀⠀⢸⡧⡄⠀⠹⣇⡆⠀⠀⠀⠀⠀⣿⠀⢰⣏⠀⣿⣸⣿⣿⠀⠀⠀⠀⣼⠀⠀⠰⠗⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⠀⠀⠀⠀⢸⡇⣷⣛⣦⣿⢀⠈⠑⠀⢠⡆⣿⠐⢠⣟⠁⢸⠸⣿⣿⢱⣤⢀⠀⣼⠀⠀⢀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⢀⠀⠀⠀⢸⡇⠘⠫⣟⡇⠊⣣⠘⠛⣾⡆⢿⠀⠙⣿⢀⣘⡃⣿⣿⡏⠉⠒⠂⡿⠀⠰⣾⡄⠀⢸⡟⣽⣀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⡇⠀⠘⣾⠀⠀⢸⡇⢸⣇⡙⠣⠀⣹⣇⠀⠈⠧⢀⣀⣀⡏⣸⣿⣇⢹⣿⡇⢴⣴⣄⣀⡀⢰⣿⡇⠀⢸⣇⢿⡿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠓⠁⠈⠻⢷⠾⠦⠤⠬⣅⣹⣿⣖⣶⣲⣈⡥⠤⠶⡖⠛⠒⠛⠁⠉⠛⠮⠐⢛⡓⠒⢛⠚⠒⠒⠒⠛⣚⣫⡼⠿⠿⣯⠛⠤⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⡉⠉⠁⠀⠀⠘⠓⠀⠀⠀⠀⠀⣀⣞⡿⡉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣶⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
''')
print(
    "Kemudian, kamu pergi ke sebuah hutan.\nDi dalam hutan tersebut kamu menemukan sebuah penunjuk jalan.\nNamun, ternyata penunjuk jalan tersebut justru membuatmu tersesat."
)
print(
    "\nLalu kamu menemukan seekor beruang besar di hutan tersebut.\nApa yang sedang dilakukan beruang tersebut?"
)
hutan = input(
    "1 = Beruang itu gak melihat keberadaan dirimu\n2 = Beruang itu hanya melihat dirimu\n3 = beruang itu sedang menuju ke arahmu dengan penuh ancaman? "
)

if hutan == "1":
    print(
        '\n"Menunjukan kamu itu orang yang gak mudah stres dengan permasalahan yang sedang dihadapi."\n'
    )
elif hutan == "2":
    print(
        '\n"Berarti kamu cukup dibuat gelisah dengan masalah-masalah yang menimpamu."\n'
    )
else:
    print(
        '\n"Kamu termasuk orang yang gampang stres saat menghadapi masalah."\n'
    )

print('''\n


   ______________________________________________________
   [[]]-[[]]-[[]]-[[]]-[[]]-[[]]-[[]]-[[]]-[[]]-[[]]-[[]]
   .-.`| `-/-.__/.-'\_.-._,'/`-._'\_.-._`-'_/-._.'|/.-'\-
   \_.-`./`-._'\__.-`-.__.-`--._/--.`-._\`-._\__.-)`-'._/
   `._-'.\_.---._-.\_`-..`\_.---._`-.__.-`'._.--./`-'._,'
   __/`.-/       `.'_`./`.'       '.\__.-`.'    (_.-\_,-.
   `._-/'          |._.-|           |.'`.|       `(_.`-._
   .-',`)          | /`.|           |`-/`|         ;.-'_/
   `\,-/           |\.-'|           |\-'`|          ;\_,-
    -./`._        [[[[[[[[         [[[[[[[[         .',-'
    `.`--.~~-^_~-/.`-._`-.\^~-_~-^/`-.'-,.'\^~-~_^"'`-.'_
    -,.'"-"~^-~_~- - - _- -~^-_.~ - -_ - - -~- . "'"-"-""
    ""-'"-""-"~- _~.^-~-^.-^_.- .^~.-  ~-. ~^_-""-""-"'-"
       ""-'"-"    ~- ^. - ~ -~^ - ~  ^~- ~     ""-"'-'



''')
print(
    "\nKemudian kamu terus mencari jalan keluar dari hutan,\nhingga menemukan sebuah jembatan sempit di atas sungai.\nKamu memutuskan melewati jembatan tersebut.\nSesampainya di tengah jembatan, kamu berpapasan dengan seseorang."
)
print(
    "Karena jembatan sangat sempit, salah satu dari kalian harus mundur. Apa yang kamu lakukan?\n"
)
jembatan = input(
    "1 = Beradu argumen.\n2 = Mengalah.\n3 = Membiarkan orang tersebut mengalah."
)

if jembatan == "1":
    print(
        '\n"Kamu termasuk orang yang cukup konfrontatif dalam menjalani hidup."'
    )
elif jembatan == "2":
    print('\n"Kamu termasuk orang yang sopan dan fleksibel."')
else:
    print('\n"Kamu rupanya orang yang idealis."')

print("\n")
print("Terimakasi atas waktunya.\ndiharapkan untuk feedbacknya")
print("\nTest ini hanya di gunakan untuk penerapan apa yang saya pelajari")
print("Jika ada kesalahan mohon dimaafkan")
print("silahkan kunjungi situs resminya.\n")
print(
    "https://www.idntimes.com/life/inspiration/rully-bunga/tes-psikologi-untuk-membaca-kepribadian?page=all"
)
